Repository: tahil-app/backend
Catalog: Tahil.API/Resources/Locales.*.resx
Languages: ar

source: Attachment
ar: المرفق

# NotFoundAttachment
source: Attachment is not found
ar: المرفق غير متاح

# NotAvailableAttachment
source: Attachment is not available anymore
ar: المرفق لم يعد متاحا

source: cannot be null
ar: يجب ان تحتوى على قيمة

# ConflictBusyTime
source: This time is busy, select another
ar: هذا الوقت غير متاح , اختر وقت اخر

source: Course
ar: الدورة

# CourseHasSchedules
source: Course has schedules, cannot delete
ar: الدورة لها جداول، لا يمكن حذفها

# CourseHasSessions
source: Course has sessions, cannot delete
ar: الدورة لها جلسات، لا يمكن حذفها

# CourseHasTeachers
source: Course has teachers, cannot delete
ar: الدورة لها معلمين، لا يمكن حذفها

# CourseNameTooLong
source: Course name cannot exceed 100 characters
ar: اسم الدورة لا يمكن أن يتجاوز 100 حرف

# CourseNameTooShort
source: Course name must be at least 2 characters
ar: اسم الدورة يجب أن يكون على الأقل 2 أحرف

source: Email
ar: البريد الالكترونى

source: End Date
ar: وقت الانتهاء

source: Group
ar: المجموعة

# GroupHasStudentCantDelete
source: The group has students, You can't delete it
ar: المجموعة مسجل بها طلاب, لا يمكن حذفها

# GroupHasSchedules
source: Group has schedules, cannot delete
ar: المجموعة لها جداول، لا يمكن حذفها

# GroupHasSessions
source: Group has sessions, cannot delete
ar: المجموعة لها جلسات، لا يمكن حذفها

# GroupNameTooLong
source: Group name cannot exceed 100 characters
ar: اسم المجموعة لا يمكن أن يتجاوز 100 حرف

# GroupNameTooShort
source: Group name must be at least 2 characters
ar: اسم المجموعة يجب أن يكون على الأقل 2 أحرف

source: Invalid credentials
ar: بيانات الدخول غير صحيحة

# InvalidEmailFormat
source: in invalid format
ar: البريد غير صحيح

source: Invalid refresh token
ar: حدث خطأ فى انشاء الرمز

source: is duplicated
ar: مكرر

# IsNotAvailable
source: is not available anymore
ar: لم يعد متاحا

# IsNotFount
source: is not found
ar: غير متاح

source: is required
ar: مطلوب

# MustBePositive
source: must be greater than zero
ar: يجب ان تكون القيمة اكبر من 0

source: Name
ar: الاسم

source: Password
ar: الرقم السرى

# PasswordTooShort
source: Password must be at least 6 characters
ar: كلمة المرور يجب أن تكون على الأقل 6 أحرف

source: PhoneNumber
ar: رقم الهاتف

source: Room
ar: الحلقة

# RoomHasSchedules
source: Room has schedules, cannot delete
ar: الحلقة لها جداول، لا يمكن حذفها

# RoomHasSessions
source: Room has sessions, cannot delete
ar: الحلقة لها جلسات، لا يمكن حذفها

# RoomNameTooLong
source: Room name cannot exceed 100 characters
ar: اسم الحلقة لا يمكن أن يتجاوز 100 حرف

# RoomNameTooShort
source: Room name must be at least 2 characters
ar: اسم الحلقة يجب أن يكون على الأقل 2 أحرف

# ServerRunning
source: The server is running :)
ar: :) السيرفر يعمل

# StartAndEndDatesValidation
source: Start Date must be less than or equal to End Date.
ar: تاريخ البداية يجب ان يكون اقل او يساوى تاريخ الانتهاء

source: Start Date
ar: وقت البداية

source: Student
ar: الطالب

# StudentHasGroups
source: Student has groups, cannot delete
ar: الطالب مسجل في مجموعات، لا يمكن حذفه

# StudentHasAttachments
source: Student has attachments, cannot delete
ar: الطالب له مرفقات، لا يمكن حذفه

# StudentNameTooLong
source: Student name cannot exceed 100 characters
ar: اسم الطالب لا يمكن أن يتجاوز 100 حرف

# StudentNameTooShort
source: Student name must be at least 2 characters
ar: اسم الطالب يجب أن يكون على الأقل 2 أحرف

# StudentQualificationTooLong
source: Student qualification cannot exceed 200 characters
ar: مؤهلات الطالب لا يمكن أن تتجاوز 200 حرف

source: Teacher
ar: المعلم

# TeacherHasCourses
source: Teacher has courses, cannot delete
ar: المعلم له دورات، لا يمكن حذفه

# TeacherHasAttachments
source: Teacher has attachments, cannot delete
ar: المعلم له مرفقات، لا يمكن حذفه

# TeacherNameTooLong
source: Teacher name cannot exceed 100 characters
ar: اسم المعلم لا يمكن أن يتجاوز 100 حرف

# TeacherNameTooShort
source: Teacher name must be at least 2 characters
ar: اسم المعلم يجب أن يكون على الأقل 2 أحرف

# TeacherExperienceTooLong
source: Teacher experience cannot exceed 500 characters
ar: خبرة المعلم لا يمكن أن تتجاوز 500 حرف

# TeacherQualificationTooLong
source: Teacher qualification cannot exceed 200 characters
ar: مؤهلات المعلم لا يمكن أن تتجاوز 200 حرف

source: User
ar: المستخدم

# UserHasTeachers
source: User has teachers, cannot delete
ar: المستخدم له معلمين، لا يمكن حذفه

# UserHasStudents
source: User has students, cannot delete
ar: المستخدم له طلاب، لا يمكن حذفه

source: Employee
ar: الموظف

# EmployeeNameTooLong
source: Employee name cannot exceed 100 characters
ar: اسم الموظف لا يمكن أن يتجاوز 100 حرف

# EmployeeNameTooShort
source: Employee name must be at least 2 characters
ar: اسم الموظف يجب أن يكون على الأقل 2 أحرف
